import FaqItem from "./components/FaqItem";
import { FAQ } from "../../../utils/interfaces/general";
import faqImage from "../../../assets/img/faq_image.png";
import styles from "./FaqPage.module.scss";
import classNames from "classnames";

const faqQuestions: FAQ[] = [
  {
    question: "Қосылу алдында курсты тексеру мүмкіндігі бар ма?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
  {
    question:
      "Курстар қанша уақытқа созылады және оқу қарқынын реттеуге бола ма?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
  {
    question:
      "Оқу кезінде қандай қолдау және кері байланыс мүмкіндіктері беріледі?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
  {
    question: "Курстың бағасына қандай ресурстар мен материалдар кіреді?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
  {
    question:
      "Оқыту сапасына кепілдік бар ма және қандай нәтиже күтуге болады?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
];

const FaqPage: React.FC = () => {
  return (
    <section className={classNames("container", styles.faq)}>
      <div className={styles.part}>
        <h2 className="section-title">Жиі қойылатын сұрақтарға жауаптар</h2>
        <p className="section-text">
          Мұнда сіз біздің курстар туралы жиі кездесетін сұрақтарға жауап таба
          аласыз. Егер сізде қосымша сұрақтар туындаса, біздің қолдау қызметіне
          хабарласыңыз.
        </p>
        <img src={faqImage} alt="FAQ" className={styles.img} />
      </div>
      <div className={styles.part}>
        {faqQuestions.map((faq) => (
          <FaqItem question={faq.question} answer={faq.answer} />
        ))}
      </div>
    </section>
  );
};

export default FaqPage;
